def solution(letter):
    morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }
    
    # 공백으로 모스부호 분리
    morse_codes = letter.split(' ')
    
    # 각 모스부호를 해당하는 영어 소문자로 변환
    result = ''
    
    for code in morse_codes:
        result += morse[code]
    
    return result